/*
算法设计与分析 1.5 我想静静
给定一个数组，除了一个数只出现一次以外，其他数都出现了两次。你要做的就是找出只出现一次的数。

★输入格式
输入第一行为一个数 N，代表一共有 N 个人。
接下来一行有 N 个整数，表示他们的编号。
对于50%的数据，N <= 2000。
对于80%的数据，N <= 200000。
对于100%的数据，N <= 2000000且为奇数，编号的范围在int范围内且非负。

★输出格式
输出只出现了一次的那个数。

★样例输入
5
1 1 0 2 2
★样例输出
0
★提示
输入规模较大，请使用scanf/printf。
*/

/*
使用异或
交换律：a ^ b ^ c <=> a ^ c ^ b
相同的数异或为0: n ^ n => 0
任何数于0异或为任何数 0 ^ n => n
*/
#include<bits/stdc++.h>

int main(){
	int n, a;
	scanf("%d",&n);
	
	int res=0;
	while(n--){
		scanf("%d",&a);
		res ^= a;
	} 
	printf("%d",res);
	return 0;
}
